Scenario:
Batch job with weak monitoring, no RC handling, generic MONMSG


PGM
DCL VAR(&JOBSTS) TYPE(*CHAR) LEN(10)
DCL VAR(&RC) TYPE(*DEC) LEN(5 0)
DCL VAR(&MSG) TYPE(*CHAR) LEN(100)

CHGVAR VAR(&JOBSTS) VALUE('STARTED')

CALL PGM(ORDCALC)
MONMSG MSGID(CPF0000)

CALL PGM(ORDRPTGEN)
MONMSG MSGID(CPF0000)

IF COND(&RC *NE 0) THEN(DO)
   CHGVAR VAR(&MSG) VALUE('Order processing failed')
   SNDPGMMSG MSG(&MSG)
ENDDO

CHGVAR VAR(&JOBSTS) VALUE('ENDED')
SNDPGMMSG MSG('Job completed')

ENDPGM
